SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG22/Include/efr32bg22_rac.h
/* Bit fields for RAC PATRIM1 */
#define _RAC_PATRIM1_RESETVALUE                                       0x0003AB97UL                                             /**< Default value for RAC_PATRIM1               */
#define _RAC_PATRIM1_MASK                                             0x0007FFFFUL                                             /**< Mask for RAC_PATRIM1                        */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_SHIFT                  0                                                        /**< Shift value for RAC_TX0DBMTRIMPREDRVREGIBCORE*/
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_MASK                   0x3UL                                                    /**< Bit mask for RAC_TX0DBMTRIMPREDRVREGIBCORE  */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_DEFAULT                0x00000003UL                                             /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_i_4u                   0x00000000UL                                             /**< Mode i_4u for RAC_PATRIM1                   */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_i_5u                   0x00000001UL                                             /**< Mode i_5u for RAC_PATRIM1                   */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_i_6u                   0x00000002UL                                             /**< Mode i_6u for RAC_PATRIM1                   */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_i_7u                   0x00000003UL                                             /**< Mode i_7u for RAC_PATRIM1                   */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_DEFAULT                 (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_DEFAULT << 0)    /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_i_4u                    (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_i_4u << 0)       /**< Shifted mode i_4u for RAC_PATRIM1           */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_i_5u                    (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_i_5u << 0)       /**< Shifted mode i_5u for RAC_PATRIM1           */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_i_6u                    (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_i_6u << 0)       /**< Shifted mode i_6u for RAC_PATRIM1           */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_i_7u                    (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBCORE_i_7u << 0)       /**< Shifted mode i_7u for RAC_PATRIM1           */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_SHIFT                  2                                                        /**< Shift value for RAC_TX0DBMTRIMPREDRVREGIBNDIO*/
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_MASK                   0x3CUL                                                   /**< Bit mask for RAC_TX0DBMTRIMPREDRVREGIBNDIO  */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_DEFAULT                0x00000005UL                                             /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p127             0x00000000UL                                             /**< Mode vreg_1p127 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p171             0x00000001UL                                             /**< Mode vreg_1p171 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p209             0x00000002UL                                             /**< Mode vreg_1p209 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p244             0x00000003UL                                             /**< Mode vreg_1p244 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p275             0x00000004UL                                             /**< Mode vreg_1p275 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p305             0x00000005UL                                             /**< Mode vreg_1p305 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p335             0x00000006UL                                             /**< Mode vreg_1p335 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p363             0x00000007UL                                             /**< Mode vreg_1p363 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p388             0x00000008UL                                             /**< Mode vreg_1p388 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p414             0x00000009UL                                             /**< Mode vreg_1p414 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p439             0x0000000AUL                                             /**< Mode vreg_1p439 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p464             0x0000000BUL                                             /**< Mode vreg_1p464 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p486             0x0000000CUL                                             /**< Mode vreg_1p486 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p506             0x0000000DUL                                             /**< Mode vreg_1p506 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p525             0x0000000EUL                                             /**< Mode vreg_1p525 for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p545             0x0000000FUL                                             /**< Mode vreg_1p545 for RAC_PATRIM1             */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_DEFAULT                 (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_DEFAULT << 2)    /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p127              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p127 << 2) /**< Shifted mode vreg_1p127 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p171              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p171 << 2) /**< Shifted mode vreg_1p171 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p209              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p209 << 2) /**< Shifted mode vreg_1p209 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p244              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p244 << 2) /**< Shifted mode vreg_1p244 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p275              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p275 << 2) /**< Shifted mode vreg_1p275 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p305              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p305 << 2) /**< Shifted mode vreg_1p305 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p335              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p335 << 2) /**< Shifted mode vreg_1p335 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p363              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p363 << 2) /**< Shifted mode vreg_1p363 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p388              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p388 << 2) /**< Shifted mode vreg_1p388 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p414              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p414 << 2) /**< Shifted mode vreg_1p414 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p439              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p439 << 2) /**< Shifted mode vreg_1p439 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p464              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p464 << 2) /**< Shifted mode vreg_1p464 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p486              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p486 << 2) /**< Shifted mode vreg_1p486 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p506              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p506 << 2) /**< Shifted mode vreg_1p506 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p525              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p525 << 2) /**< Shifted mode vreg_1p525 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p545              (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGIBNDIO_vreg_1p545 << 2) /**< Shifted mode vreg_1p545 for RAC_PATRIM1     */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGPSR                            (0x1UL << 6)                                             /**< TX0DBMTRIMPREDRVREGPSR                      */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGPSR_SHIFT                     6                                                        /**< Shift value for RAC_TX0DBMTRIMPREDRVREGPSR  */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGPSR_MASK                      0x40UL                                                   /**< Bit mask for RAC_TX0DBMTRIMPREDRVREGPSR     */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGPSR_DEFAULT                   0x00000000UL                                             /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGPSR_disable                   0x00000000UL                                             /**< Mode disable for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVREGPSR_enable                    0x00000001UL                                             /**< Mode enable for RAC_PATRIM1                 */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGPSR_DEFAULT                    (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGPSR_DEFAULT << 6)       /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGPSR_disable                    (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGPSR_disable << 6)       /**< Shifted mode disable for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVREGPSR_enable                     (_RAC_PATRIM1_TX0DBMTRIMPREDRVREGPSR_enable << 6)        /**< Shifted mode enable for RAC_PATRIM1         */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_SHIFT                      7                                                        /**< Shift value for RAC_TX0DBMTRIMPREDRVSLOPE   */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_MASK                       0x180UL                                                  /**< Bit mask for RAC_TX0DBMTRIMPREDRVSLOPE      */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_DEFAULT                    0x00000003UL                                             /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_slope_0                    0x00000000UL                                             /**< Mode slope_0 for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_slope_1                    0x00000001UL                                             /**< Mode slope_1 for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_slope_2                    0x00000002UL                                             /**< Mode slope_2 for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_slope_max                  0x00000003UL                                             /**< Mode slope_max for RAC_PATRIM1              */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_DEFAULT                     (_RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_DEFAULT << 7)        /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_slope_0                     (_RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_slope_0 << 7)        /**< Shifted mode slope_0 for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_slope_1                     (_RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_slope_1 << 7)        /**< Shifted mode slope_1 for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_slope_2                     (_RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_slope_2 << 7)        /**< Shifted mode slope_2 for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_slope_max                   (_RAC_PATRIM1_TX0DBMTRIMPREDRVSLOPE_slope_max << 7)      /**< Shifted mode slope_max for RAC_PATRIM1      */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_SHIFT                            9                                                        /**< Shift value for RAC_TX0DBMTRIMREGFB         */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_MASK                             0x1E00UL                                                 /**< Bit mask for RAC_TX0DBMTRIMREGFB            */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_DEFAULT                          0x00000005UL                                             /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p475                      0x00000000UL                                             /**< Mode vo_vi_0p475 for RAC_PATRIM1            */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p500                      0x00000001UL                                             /**< Mode vo_vi_0p500 for RAC_PATRIM1            */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p525                      0x00000002UL                                             /**< Mode vo_vi_0p525 for RAC_PATRIM1            */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p550                      0x00000003UL                                             /**< Mode vo_vi_0p550 for RAC_PATRIM1            */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p575                      0x00000004UL                                             /**< Mode vo_vi_0p575 for RAC_PATRIM1            */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p600                      0x00000005UL                                             /**< Mode vo_vi_0p600 for RAC_PATRIM1            */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p625                      0x00000006UL                                             /**< Mode vo_vi_0p625 for RAC_PATRIM1            */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p650                      0x00000007UL                                             /**< Mode vo_vi_0p650 for RAC_PATRIM1            */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p675                      0x00000008UL                                             /**< Mode vo_vi_0p675 for RAC_PATRIM1            */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p700                      0x00000009UL                                             /**< Mode vo_vi_0p700 for RAC_PATRIM1            */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p725                      0x0000000AUL                                             /**< Mode vo_vi_0p725 for RAC_PATRIM1            */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p750                      0x0000000BUL                                             /**< Mode vo_vi_0p750 for RAC_PATRIM1            */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p775                      0x0000000CUL                                             /**< Mode vo_vi_0p775 for RAC_PATRIM1            */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p800                      0x0000000DUL                                             /**< Mode vo_vi_0p800 for RAC_PATRIM1            */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p825                      0x0000000EUL                                             /**< Mode vo_vi_0p825 for RAC_PATRIM1            */
#define _RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p850                      0x0000000FUL                                             /**< Mode vo_vi_0p850 for RAC_PATRIM1            */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_DEFAULT                           (_RAC_PATRIM1_TX0DBMTRIMREGFB_DEFAULT << 9)              /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p475                       (_RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p475 << 9)          /**< Shifted mode vo_vi_0p475 for RAC_PATRIM1    */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p500                       (_RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p500 << 9)          /**< Shifted mode vo_vi_0p500 for RAC_PATRIM1    */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p525                       (_RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p525 << 9)          /**< Shifted mode vo_vi_0p525 for RAC_PATRIM1    */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p550                       (_RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p550 << 9)          /**< Shifted mode vo_vi_0p550 for RAC_PATRIM1    */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p575                       (_RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p575 << 9)          /**< Shifted mode vo_vi_0p575 for RAC_PATRIM1    */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p600                       (_RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p600 << 9)          /**< Shifted mode vo_vi_0p600 for RAC_PATRIM1    */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p625                       (_RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p625 << 9)          /**< Shifted mode vo_vi_0p625 for RAC_PATRIM1    */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p650                       (_RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p650 << 9)          /**< Shifted mode vo_vi_0p650 for RAC_PATRIM1    */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p675                       (_RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p675 << 9)          /**< Shifted mode vo_vi_0p675 for RAC_PATRIM1    */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p700                       (_RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p700 << 9)          /**< Shifted mode vo_vi_0p700 for RAC_PATRIM1    */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p725                       (_RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p725 << 9)          /**< Shifted mode vo_vi_0p725 for RAC_PATRIM1    */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p750                       (_RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p750 << 9)          /**< Shifted mode vo_vi_0p750 for RAC_PATRIM1    */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p775                       (_RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p775 << 9)          /**< Shifted mode vo_vi_0p775 for RAC_PATRIM1    */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p800                       (_RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p800 << 9)          /**< Shifted mode vo_vi_0p800 for RAC_PATRIM1    */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p825                       (_RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p825 << 9)          /**< Shifted mode vo_vi_0p825 for RAC_PATRIM1    */
#define RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p850                       (_RAC_PATRIM1_TX0DBMTRIMREGFB_vo_vi_0p850 << 9)          /**< Shifted mode vo_vi_0p850 for RAC_PATRIM1    */
#define _RAC_PATRIM1_TX0DBMTRIMREGVREF_SHIFT                          13                                                       /**< Shift value for RAC_TX0DBMTRIMREGVREF       */
#define _RAC_PATRIM1_TX0DBMTRIMREGVREF_MASK                           0xE000UL                                                 /**< Bit mask for RAC_TX0DBMTRIMREGVREF          */
#define _RAC_PATRIM1_TX0DBMTRIMREGVREF_DEFAULT                        0x00000005UL                                             /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMREGVREF_v_900m                         0x00000000UL                                             /**< Mode v_900m for RAC_PATRIM1                 */
#define _RAC_PATRIM1_TX0DBMTRIMREGVREF_v_912p5m                       0x00000001UL                                             /**< Mode v_912p5m for RAC_PATRIM1               */
#define _RAC_PATRIM1_TX0DBMTRIMREGVREF_v_925m                         0x00000002UL                                             /**< Mode v_925m for RAC_PATRIM1                 */
#define _RAC_PATRIM1_TX0DBMTRIMREGVREF_v_937p5m                       0x00000003UL                                             /**< Mode v_937p5m for RAC_PATRIM1               */
#define _RAC_PATRIM1_TX0DBMTRIMREGVREF_v_950m                         0x00000004UL                                             /**< Mode v_950m for RAC_PATRIM1                 */
#define _RAC_PATRIM1_TX0DBMTRIMREGVREF_v_962p5m                       0x00000005UL                                             /**< Mode v_962p5m for RAC_PATRIM1               */
#define _RAC_PATRIM1_TX0DBMTRIMREGVREF_v_975m                         0x00000006UL                                             /**< Mode v_975m for RAC_PATRIM1                 */
#define _RAC_PATRIM1_TX0DBMTRIMREGVREF_v_987p5m                       0x00000007UL                                             /**< Mode v_987p5m for RAC_PATRIM1               */
#define RAC_PATRIM1_TX0DBMTRIMREGVREF_DEFAULT                         (_RAC_PATRIM1_TX0DBMTRIMREGVREF_DEFAULT << 13)           /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_TX0DBMTRIMREGVREF_v_900m                          (_RAC_PATRIM1_TX0DBMTRIMREGVREF_v_900m << 13)            /**< Shifted mode v_900m for RAC_PATRIM1         */
#define RAC_PATRIM1_TX0DBMTRIMREGVREF_v_912p5m                        (_RAC_PATRIM1_TX0DBMTRIMREGVREF_v_912p5m << 13)          /**< Shifted mode v_912p5m for RAC_PATRIM1       */
#define RAC_PATRIM1_TX0DBMTRIMREGVREF_v_925m                          (_RAC_PATRIM1_TX0DBMTRIMREGVREF_v_925m << 13)            /**< Shifted mode v_925m for RAC_PATRIM1         */
#define RAC_PATRIM1_TX0DBMTRIMREGVREF_v_937p5m                        (_RAC_PATRIM1_TX0DBMTRIMREGVREF_v_937p5m << 13)          /**< Shifted mode v_937p5m for RAC_PATRIM1       */
#define RAC_PATRIM1_TX0DBMTRIMREGVREF_v_950m                          (_RAC_PATRIM1_TX0DBMTRIMREGVREF_v_950m << 13)            /**< Shifted mode v_950m for RAC_PATRIM1         */
#define RAC_PATRIM1_TX0DBMTRIMREGVREF_v_962p5m                        (_RAC_PATRIM1_TX0DBMTRIMREGVREF_v_962p5m << 13)          /**< Shifted mode v_962p5m for RAC_PATRIM1       */
#define RAC_PATRIM1_TX0DBMTRIMREGVREF_v_975m                          (_RAC_PATRIM1_TX0DBMTRIMREGVREF_v_975m << 13)            /**< Shifted mode v_975m for RAC_PATRIM1         */
#define RAC_PATRIM1_TX0DBMTRIMREGVREF_v_987p5m                        (_RAC_PATRIM1_TX0DBMTRIMREGVREF_v_987p5m << 13)          /**< Shifted mode v_987p5m for RAC_PATRIM1       */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP_SHIFT                           16                                                       /**< Shift value for RAC_TX0DBMTRIMTAPCAP        */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP_MASK                            0x70000UL                                                /**< Bit mask for RAC_TX0DBMTRIMTAPCAP           */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP_DEFAULT                         0x00000003UL                                             /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP_cap_0F                          0x00000000UL                                             /**< Mode cap_0F for RAC_PATRIM1                 */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP_cap_0p35pF                      0x00000001UL                                             /**< Mode cap_0p35pF for RAC_PATRIM1             */
#define _RAC_PATRIM1_TX0DBMTRIMTAPCAP_cap_0p7pF                       0x00000002UL                                             /**< Mode cap_0p7pF for RAC_PATRIM1              */
